<1><1e>
Abbrev Number: 2 (DW_TAG_variable)
DW_AT_name        : (indirect string, offset: 0xa8): mpers_target_var
DW_AT_type        : <0x30>
DW_AT_external    : 1
DW_AT_decl_file   : 3
DW_AT_decl_line   : 47
DW_AT_location    : 5 byte block: 3 8 0 0 0 	(DW_OP_addr: 8)
<1><30>
Abbrev Number: 3 (DW_TAG_typedef)
DW_AT_type        : <0x3b>
DW_AT_name        : (indirect string, offset: 0x21c): struct_btrfs_ioctl_dev_replace_args
DW_AT_decl_file   : 3
DW_AT_decl_line   : 37
<1><3b>
Abbrev Number: 4 (DW_TAG_structure_type)
DW_AT_name        : (indirect string, offset: 0x1ff): btrfs_ioctl_dev_replace_args
DW_AT_byte_size   : 2600
DW_AT_decl_file   : 2
DW_AT_decl_line   : 137
<2><44>
Abbrev Number: 5 (DW_TAG_member)
DW_AT_name        : (indirect string, offset: 0xb9): cmd
DW_AT_type        : <0x9c>
DW_AT_decl_file   : 2
DW_AT_decl_line   : 138
DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
<2><52>
Abbrev Number: 5 (DW_TAG_member)
DW_AT_name        : (indirect string, offset: 0xda): result
DW_AT_type        : <0x9c>
DW_AT_decl_file   : 2
DW_AT_decl_line   : 139
DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
<2><60>
Abbrev Number: 6 (DW_TAG_member)
DW_AT_type        : <0x6a>
DW_AT_decl_file   : 2
DW_AT_decl_line   : 140
DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
<2><6a>
Abbrev Number: 7 (DW_TAG_union_type)
DW_AT_byte_size   : 2072
DW_AT_decl_file   : 2
DW_AT_decl_line   : 140
<3><6f>
Abbrev Number: 5 (DW_TAG_member)
DW_AT_name        : (indirect string, offset: 0xe1): start
DW_AT_type        : <0xae>
DW_AT_decl_file   : 2
DW_AT_decl_line   : 141
DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
<3><7d>
Abbrev Number: 5 (DW_TAG_member)
DW_AT_name        : (indirect string, offset: 0x167): status
DW_AT_type        : <0x118>
DW_AT_decl_file   : 2
DW_AT_decl_line   : 142
DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
<2><8c>
Abbrev Number: 5 (DW_TAG_member)
DW_AT_name        : (indirect string, offset: 0x1f9): spare
DW_AT_type        : <0x175>
DW_AT_decl_file   : 2
DW_AT_decl_line   : 144
DW_AT_data_member_location: 3 byte block: 23 a8 10 	(DW_OP_plus_uconst: 2088)
<1><9c>
Abbrev Number: 3 (DW_TAG_typedef)
DW_AT_type        : <0xa7>
DW_AT_name        : (indirect string, offset: 0xd4): __u64
DW_AT_decl_file   : 1
DW_AT_decl_line   : 31
<1><a7>
Abbrev Number: 8 (DW_TAG_base_type)
DW_AT_name        : (indirect string, offset: 0xbd): long long unsigned int
DW_AT_encoding    : 7	(unsigned)
DW_AT_byte_size   : 8
<1><ae>
Abbrev Number: 4 (DW_TAG_structure_type)
DW_AT_name        : (indirect string, offset: 0x142): btrfs_ioctl_dev_replace_start_params
DW_AT_byte_size   : 2072
DW_AT_decl_file   : 2
DW_AT_decl_line   : 111
<2><b7>
Abbrev Number: 5 (DW_TAG_member)
DW_AT_name        : (indirect string, offset: 0xe7): srcdevid
DW_AT_type        : <0x9c>
DW_AT_decl_file   : 2
DW_AT_decl_line   : 112
DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
<2><c5>
Abbrev Number: 5 (DW_TAG_member)
DW_AT_name        : (indirect string, offset: 0xf0): cont_reading_from_srcdev_mode
DW_AT_type        : <0x9c>
DW_AT_decl_file   : 2
DW_AT_decl_line   : 113
DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
<2><d3>
Abbrev Number: 5 (DW_TAG_member)
DW_AT_name        : (indirect string, offset: 0x10e): srcdev_name
DW_AT_type        : <0xf1>
DW_AT_decl_file   : 2
DW_AT_decl_line   : 114
DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
<2><e1>
Abbrev Number: 5 (DW_TAG_member)
DW_AT_name        : (indirect string, offset: 0x136): tgtdev_name
DW_AT_type        : <0xf1>
DW_AT_decl_file   : 2
DW_AT_decl_line   : 115
DW_AT_data_member_location: 3 byte block: 23 91 8 	(DW_OP_plus_uconst: 1041)
<1><f1>
Abbrev Number: 9 (DW_TAG_array_type)
DW_AT_type        : <0xff>
<2><f6>
Abbrev Number: 10 (DW_TAG_subrange_type)
DW_AT_type        : <0x111>
DW_AT_lower_bound : 0
DW_AT_count       : 1025
<1><ff>
Abbrev Number: 3 (DW_TAG_typedef)
DW_AT_type        : <0x10a>
DW_AT_name        : (indirect string, offset: 0x128): __u8
DW_AT_decl_file   : 1
DW_AT_decl_line   : 24
<1><10a>
Abbrev Number: 8 (DW_TAG_base_type)
DW_AT_name        : (indirect string, offset: 0x11a): unsigned char
DW_AT_encoding    : 8	(unsigned char)
DW_AT_byte_size   : 1
<1><111>
Abbrev Number: 11 (DW_TAG_base_type)
DW_AT_name        : (indirect string, offset: 0x12d): sizetype
DW_AT_byte_size   : 8
DW_AT_encoding    : 7	(unsigned)
<1><118>
Abbrev Number: 12 (DW_TAG_structure_type)
DW_AT_name        : (indirect string, offset: 0x1d3): btrfs_ioctl_dev_replace_status_params
DW_AT_byte_size   : 48
DW_AT_decl_file   : 2
DW_AT_decl_line   : 122
<2><120>
Abbrev Number: 5 (DW_TAG_member)
DW_AT_name        : (indirect string, offset: 0x16e): replace_state
DW_AT_type        : <0x9c>
DW_AT_decl_file   : 2
DW_AT_decl_line   : 123
DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
<2><12e>
Abbrev Number: 5 (DW_TAG_member)
DW_AT_name        : (indirect string, offset: 0x17c): progress_1000
DW_AT_type        : <0x9c>
DW_AT_decl_file   : 2
DW_AT_decl_line   : 124
DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
<2><13c>
Abbrev Number: 5 (DW_TAG_member)
DW_AT_name        : (indirect string, offset: 0x18a): time_started
DW_AT_type        : <0x9c>
DW_AT_decl_file   : 2
DW_AT_decl_line   : 125
DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
<2><14a>
Abbrev Number: 5 (DW_TAG_member)
DW_AT_name        : (indirect string, offset: 0x197): time_stopped
DW_AT_type        : <0x9c>
DW_AT_decl_file   : 2
DW_AT_decl_line   : 126
DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
<2><158>
Abbrev Number: 5 (DW_TAG_member)
DW_AT_name        : (indirect string, offset: 0x1a4): num_write_errors
DW_AT_type        : <0x9c>
DW_AT_decl_file   : 2
DW_AT_decl_line   : 127
DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
<2><166>
Abbrev Number: 5 (DW_TAG_member)
DW_AT_name        : (indirect string, offset: 0x1b5): num_uncorrectable_read_errors
DW_AT_type        : <0x9c>
DW_AT_decl_file   : 2
DW_AT_decl_line   : 128
DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
<1><175>
Abbrev Number: 9 (DW_TAG_array_type)
DW_AT_type        : <0x9c>
<2><17a>
Abbrev Number: 13 (DW_TAG_subrange_type)
DW_AT_type        : <0x111>
DW_AT_lower_bound : 0
DW_AT_count       : 64
