Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x17f (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x0): Android clang version 5.0.300080  (based on LLVM 5.0.300080)
    <10>   DW_AT_language    : 12	(ANSI C99)
    <12>   DW_AT_name        : (indirect string, offset: 0x3d): mpers-m32/struct_btrfs_ioctl_dev_replace_args.c
    <16>   DW_AT_stmt_list   : 0x0
    <1a>   DW_AT_comp_dir    : (indirect string, offset: 0x6d): /usr/local/google/ndkports/.out/strace/package/strace-4.22
 <1><1e>: Abbrev Number: 2 (DW_TAG_variable)
    <1f>   DW_AT_name        : (indirect string, offset: 0xa8): mpers_target_var
    <23>   DW_AT_type        : <0x30>
    <27>   DW_AT_external    : 1
    <28>   DW_AT_decl_file   : 3
    <29>   DW_AT_decl_line   : 47
    <2a>   DW_AT_location    : 5 byte block: 3 8 0 0 0 	(DW_OP_addr: 8)
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_type        : <0x3b>
    <35>   DW_AT_name        : (indirect string, offset: 0x21c): struct_btrfs_ioctl_dev_replace_args
    <39>   DW_AT_decl_file   : 3
    <3a>   DW_AT_decl_line   : 37
 <1><3b>: Abbrev Number: 4 (DW_TAG_structure_type)
    <3c>   DW_AT_name        : (indirect string, offset: 0x1ff): btrfs_ioctl_dev_replace_args
    <40>   DW_AT_byte_size   : 2600
    <42>   DW_AT_decl_file   : 2
    <43>   DW_AT_decl_line   : 137
 <2><44>: Abbrev Number: 5 (DW_TAG_member)
    <45>   DW_AT_name        : (indirect string, offset: 0xb9): cmd
    <49>   DW_AT_type        : <0x9c>
    <4d>   DW_AT_decl_file   : 2
    <4e>   DW_AT_decl_line   : 138
    <4f>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><52>: Abbrev Number: 5 (DW_TAG_member)
    <53>   DW_AT_name        : (indirect string, offset: 0xda): result
    <57>   DW_AT_type        : <0x9c>
    <5b>   DW_AT_decl_file   : 2
    <5c>   DW_AT_decl_line   : 139
    <5d>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><60>: Abbrev Number: 6 (DW_TAG_member)
    <61>   DW_AT_type        : <0x6a>
    <65>   DW_AT_decl_file   : 2
    <66>   DW_AT_decl_line   : 140
    <67>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><6a>: Abbrev Number: 7 (DW_TAG_union_type)
    <6b>   DW_AT_byte_size   : 2072
    <6d>   DW_AT_decl_file   : 2
    <6e>   DW_AT_decl_line   : 140
 <3><6f>: Abbrev Number: 5 (DW_TAG_member)
    <70>   DW_AT_name        : (indirect string, offset: 0xe1): start
    <74>   DW_AT_type        : <0xae>
    <78>   DW_AT_decl_file   : 2
    <79>   DW_AT_decl_line   : 141
    <7a>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <3><7d>: Abbrev Number: 5 (DW_TAG_member)
    <7e>   DW_AT_name        : (indirect string, offset: 0x167): status
    <82>   DW_AT_type        : <0x118>
    <86>   DW_AT_decl_file   : 2
    <87>   DW_AT_decl_line   : 142
    <88>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <3><8b>: Abbrev Number: 0
 <2><8c>: Abbrev Number: 5 (DW_TAG_member)
    <8d>   DW_AT_name        : (indirect string, offset: 0x1f9): spare
    <91>   DW_AT_type        : <0x175>
    <95>   DW_AT_decl_file   : 2
    <96>   DW_AT_decl_line   : 144
    <97>   DW_AT_data_member_location: 3 byte block: 23 a8 10 	(DW_OP_plus_uconst: 2088)
 <2><9b>: Abbrev Number: 0
 <1><9c>: Abbrev Number: 3 (DW_TAG_typedef)
    <9d>   DW_AT_type        : <0xa7>
    <a1>   DW_AT_name        : (indirect string, offset: 0xd4): __u64
    <a5>   DW_AT_decl_file   : 1
    <a6>   DW_AT_decl_line   : 31
 <1><a7>: Abbrev Number: 8 (DW_TAG_base_type)
    <a8>   DW_AT_name        : (indirect string, offset: 0xbd): long long unsigned int
    <ac>   DW_AT_encoding    : 7	(unsigned)
    <ad>   DW_AT_byte_size   : 8
 <1><ae>: Abbrev Number: 4 (DW_TAG_structure_type)
    <af>   DW_AT_name        : (indirect string, offset: 0x142): btrfs_ioctl_dev_replace_start_params
    <b3>   DW_AT_byte_size   : 2072
    <b5>   DW_AT_decl_file   : 2
    <b6>   DW_AT_decl_line   : 111
 <2><b7>: Abbrev Number: 5 (DW_TAG_member)
    <b8>   DW_AT_name        : (indirect string, offset: 0xe7): srcdevid
    <bc>   DW_AT_type        : <0x9c>
    <c0>   DW_AT_decl_file   : 2
    <c1>   DW_AT_decl_line   : 112
    <c2>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><c5>: Abbrev Number: 5 (DW_TAG_member)
    <c6>   DW_AT_name        : (indirect string, offset: 0xf0): cont_reading_from_srcdev_mode
    <ca>   DW_AT_type        : <0x9c>
    <ce>   DW_AT_decl_file   : 2
    <cf>   DW_AT_decl_line   : 113
    <d0>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><d3>: Abbrev Number: 5 (DW_TAG_member)
    <d4>   DW_AT_name        : (indirect string, offset: 0x10e): srcdev_name
    <d8>   DW_AT_type        : <0xf1>
    <dc>   DW_AT_decl_file   : 2
    <dd>   DW_AT_decl_line   : 114
    <de>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><e1>: Abbrev Number: 5 (DW_TAG_member)
    <e2>   DW_AT_name        : (indirect string, offset: 0x136): tgtdev_name
    <e6>   DW_AT_type        : <0xf1>
    <ea>   DW_AT_decl_file   : 2
    <eb>   DW_AT_decl_line   : 115
    <ec>   DW_AT_data_member_location: 3 byte block: 23 91 8 	(DW_OP_plus_uconst: 1041)
 <2><f0>: Abbrev Number: 0
 <1><f1>: Abbrev Number: 9 (DW_TAG_array_type)
    <f2>   DW_AT_type        : <0xff>
 <2><f6>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <f7>   DW_AT_type        : <0x111>
    <fb>   DW_AT_lower_bound : 0
    <fc>   DW_AT_count       : 1025
 <2><fe>: Abbrev Number: 0
 <1><ff>: Abbrev Number: 3 (DW_TAG_typedef)
    <100>   DW_AT_type        : <0x10a>
    <104>   DW_AT_name        : (indirect string, offset: 0x128): __u8
    <108>   DW_AT_decl_file   : 1
    <109>   DW_AT_decl_line   : 24
 <1><10a>: Abbrev Number: 8 (DW_TAG_base_type)
    <10b>   DW_AT_name        : (indirect string, offset: 0x11a): unsigned char
    <10f>   DW_AT_encoding    : 8	(unsigned char)
    <110>   DW_AT_byte_size   : 1
 <1><111>: Abbrev Number: 11 (DW_TAG_base_type)
    <112>   DW_AT_name        : (indirect string, offset: 0x12d): sizetype
    <116>   DW_AT_byte_size   : 8
    <117>   DW_AT_encoding    : 7	(unsigned)
 <1><118>: Abbrev Number: 12 (DW_TAG_structure_type)
    <119>   DW_AT_name        : (indirect string, offset: 0x1d3): btrfs_ioctl_dev_replace_status_params
    <11d>   DW_AT_byte_size   : 48
    <11e>   DW_AT_decl_file   : 2
    <11f>   DW_AT_decl_line   : 122
 <2><120>: Abbrev Number: 5 (DW_TAG_member)
    <121>   DW_AT_name        : (indirect string, offset: 0x16e): replace_state
    <125>   DW_AT_type        : <0x9c>
    <129>   DW_AT_decl_file   : 2
    <12a>   DW_AT_decl_line   : 123
    <12b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><12e>: Abbrev Number: 5 (DW_TAG_member)
    <12f>   DW_AT_name        : (indirect string, offset: 0x17c): progress_1000
    <133>   DW_AT_type        : <0x9c>
    <137>   DW_AT_decl_file   : 2
    <138>   DW_AT_decl_line   : 124
    <139>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><13c>: Abbrev Number: 5 (DW_TAG_member)
    <13d>   DW_AT_name        : (indirect string, offset: 0x18a): time_started
    <141>   DW_AT_type        : <0x9c>
    <145>   DW_AT_decl_file   : 2
    <146>   DW_AT_decl_line   : 125
    <147>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><14a>: Abbrev Number: 5 (DW_TAG_member)
    <14b>   DW_AT_name        : (indirect string, offset: 0x197): time_stopped
    <14f>   DW_AT_type        : <0x9c>
    <153>   DW_AT_decl_file   : 2
    <154>   DW_AT_decl_line   : 126
    <155>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><158>: Abbrev Number: 5 (DW_TAG_member)
    <159>   DW_AT_name        : (indirect string, offset: 0x1a4): num_write_errors
    <15d>   DW_AT_type        : <0x9c>
    <161>   DW_AT_decl_file   : 2
    <162>   DW_AT_decl_line   : 127
    <163>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><166>: Abbrev Number: 5 (DW_TAG_member)
    <167>   DW_AT_name        : (indirect string, offset: 0x1b5): num_uncorrectable_read_errors
    <16b>   DW_AT_type        : <0x9c>
    <16f>   DW_AT_decl_file   : 2
    <170>   DW_AT_decl_line   : 128
    <171>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><174>: Abbrev Number: 0
 <1><175>: Abbrev Number: 9 (DW_TAG_array_type)
    <176>   DW_AT_type        : <0x9c>
 <2><17a>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <17b>   DW_AT_type        : <0x111>
    <17f>   DW_AT_lower_bound : 0
    <180>   DW_AT_count       : 64
 <2><181>: Abbrev Number: 0
 <1><182>: Abbrev Number: 0

