Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x180 (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x0): Android (4691093 based on r316199) clang version 6.0.2 (https://android.googlesource.com/toolchain/clang 183abd29fc496f55536e7d904e0abae47888fc7f) (https://android.googlesource.com/toolchain/llvm 34361f192e41ed6e4e8f9aca80a4ea7e9856f327) (based on LLVM 6.0.2svn)
    <10>   DW_AT_language    : 12	(ANSI C99)
    <12>   DW_AT_name        : (indirect string, offset: 0x107): mpers-m32/struct_btrfs_ioctl_dev_replace_args.c
    <16>   DW_AT_stmt_list   : 0x0
    <1a>   DW_AT_comp_dir    : (indirect string, offset: 0x137): /usr/local/google/ndkports/.out/strace/package/strace-4.23
    <1e>   DW_AT_GNU_pubnames: 1
 <1><1f>: Abbrev Number: 2 (DW_TAG_variable)
    <20>   DW_AT_name        : (indirect string, offset: 0x172): mpers_target_var
    <24>   DW_AT_type        : <0x31>
    <28>   DW_AT_external    : 1
    <29>   DW_AT_decl_file   : 3
    <2a>   DW_AT_decl_line   : 47
    <2b>   DW_AT_location    : 5 byte block: 3 8 0 0 0 	(DW_OP_addr: 8)
 <1><31>: Abbrev Number: 3 (DW_TAG_typedef)
    <32>   DW_AT_type        : <0x3c>
    <36>   DW_AT_name        : (indirect string, offset: 0x2e6): struct_btrfs_ioctl_dev_replace_args
    <3a>   DW_AT_decl_file   : 3
    <3b>   DW_AT_decl_line   : 37
 <1><3c>: Abbrev Number: 4 (DW_TAG_structure_type)
    <3d>   DW_AT_name        : (indirect string, offset: 0x2c9): btrfs_ioctl_dev_replace_args
    <41>   DW_AT_byte_size   : 2600
    <43>   DW_AT_decl_file   : 2
    <44>   DW_AT_decl_line   : 137
 <2><45>: Abbrev Number: 5 (DW_TAG_member)
    <46>   DW_AT_name        : (indirect string, offset: 0x183): cmd
    <4a>   DW_AT_type        : <0x9d>
    <4e>   DW_AT_decl_file   : 2
    <4f>   DW_AT_decl_line   : 138
    <50>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><53>: Abbrev Number: 5 (DW_TAG_member)
    <54>   DW_AT_name        : (indirect string, offset: 0x1a4): result
    <58>   DW_AT_type        : <0x9d>
    <5c>   DW_AT_decl_file   : 2
    <5d>   DW_AT_decl_line   : 139
    <5e>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><61>: Abbrev Number: 6 (DW_TAG_member)
    <62>   DW_AT_type        : <0x6b>
    <66>   DW_AT_decl_file   : 2
    <67>   DW_AT_decl_line   : 140
    <68>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><6b>: Abbrev Number: 7 (DW_TAG_union_type)
    <6c>   DW_AT_byte_size   : 2072
    <6e>   DW_AT_decl_file   : 2
    <6f>   DW_AT_decl_line   : 140
 <3><70>: Abbrev Number: 5 (DW_TAG_member)
    <71>   DW_AT_name        : (indirect string, offset: 0x1ab): start
    <75>   DW_AT_type        : <0xaf>
    <79>   DW_AT_decl_file   : 2
    <7a>   DW_AT_decl_line   : 141
    <7b>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <3><7e>: Abbrev Number: 5 (DW_TAG_member)
    <7f>   DW_AT_name        : (indirect string, offset: 0x231): status
    <83>   DW_AT_type        : <0x119>
    <87>   DW_AT_decl_file   : 2
    <88>   DW_AT_decl_line   : 142
    <89>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <3><8c>: Abbrev Number: 0
 <2><8d>: Abbrev Number: 5 (DW_TAG_member)
    <8e>   DW_AT_name        : (indirect string, offset: 0x2c3): spare
    <92>   DW_AT_type        : <0x176>
    <96>   DW_AT_decl_file   : 2
    <97>   DW_AT_decl_line   : 144
    <98>   DW_AT_data_member_location: 3 byte block: 23 a8 10 	(DW_OP_plus_uconst: 2088)
 <2><9c>: Abbrev Number: 0
 <1><9d>: Abbrev Number: 3 (DW_TAG_typedef)
    <9e>   DW_AT_type        : <0xa8>
    <a2>   DW_AT_name        : (indirect string, offset: 0x19e): __u64
    <a6>   DW_AT_decl_file   : 1
    <a7>   DW_AT_decl_line   : 31
 <1><a8>: Abbrev Number: 8 (DW_TAG_base_type)
    <a9>   DW_AT_name        : (indirect string, offset: 0x187): long long unsigned int
    <ad>   DW_AT_encoding    : 7	(unsigned)
    <ae>   DW_AT_byte_size   : 8
 <1><af>: Abbrev Number: 4 (DW_TAG_structure_type)
    <b0>   DW_AT_name        : (indirect string, offset: 0x20c): btrfs_ioctl_dev_replace_start_params
    <b4>   DW_AT_byte_size   : 2072
    <b6>   DW_AT_decl_file   : 2
    <b7>   DW_AT_decl_line   : 111
 <2><b8>: Abbrev Number: 5 (DW_TAG_member)
    <b9>   DW_AT_name        : (indirect string, offset: 0x1b1): srcdevid
    <bd>   DW_AT_type        : <0x9d>
    <c1>   DW_AT_decl_file   : 2
    <c2>   DW_AT_decl_line   : 112
    <c3>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><c6>: Abbrev Number: 5 (DW_TAG_member)
    <c7>   DW_AT_name        : (indirect string, offset: 0x1ba): cont_reading_from_srcdev_mode
    <cb>   DW_AT_type        : <0x9d>
    <cf>   DW_AT_decl_file   : 2
    <d0>   DW_AT_decl_line   : 113
    <d1>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><d4>: Abbrev Number: 5 (DW_TAG_member)
    <d5>   DW_AT_name        : (indirect string, offset: 0x1d8): srcdev_name
    <d9>   DW_AT_type        : <0xf2>
    <dd>   DW_AT_decl_file   : 2
    <de>   DW_AT_decl_line   : 114
    <df>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><e2>: Abbrev Number: 5 (DW_TAG_member)
    <e3>   DW_AT_name        : (indirect string, offset: 0x200): tgtdev_name
    <e7>   DW_AT_type        : <0xf2>
    <eb>   DW_AT_decl_file   : 2
    <ec>   DW_AT_decl_line   : 115
    <ed>   DW_AT_data_member_location: 3 byte block: 23 91 8 	(DW_OP_plus_uconst: 1041)
 <2><f1>: Abbrev Number: 0
 <1><f2>: Abbrev Number: 9 (DW_TAG_array_type)
    <f3>   DW_AT_type        : <0x100>
 <2><f7>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <f8>   DW_AT_type        : <0x112>
    <fc>   DW_AT_lower_bound : 0
    <fd>   DW_AT_count       : 1025
 <2><ff>: Abbrev Number: 0
 <1><100>: Abbrev Number: 3 (DW_TAG_typedef)
    <101>   DW_AT_type        : <0x10b>
    <105>   DW_AT_name        : (indirect string, offset: 0x1f2): __u8
    <109>   DW_AT_decl_file   : 1
    <10a>   DW_AT_decl_line   : 24
 <1><10b>: Abbrev Number: 8 (DW_TAG_base_type)
    <10c>   DW_AT_name        : (indirect string, offset: 0x1e4): unsigned char
    <110>   DW_AT_encoding    : 8	(unsigned char)
    <111>   DW_AT_byte_size   : 1
 <1><112>: Abbrev Number: 11 (DW_TAG_base_type)
    <113>   DW_AT_name        : (indirect string, offset: 0x1f7): sizetype
    <117>   DW_AT_byte_size   : 8
    <118>   DW_AT_encoding    : 7	(unsigned)
 <1><119>: Abbrev Number: 12 (DW_TAG_structure_type)
    <11a>   DW_AT_name        : (indirect string, offset: 0x29d): btrfs_ioctl_dev_replace_status_params
    <11e>   DW_AT_byte_size   : 48
    <11f>   DW_AT_decl_file   : 2
    <120>   DW_AT_decl_line   : 122
 <2><121>: Abbrev Number: 5 (DW_TAG_member)
    <122>   DW_AT_name        : (indirect string, offset: 0x238): replace_state
    <126>   DW_AT_type        : <0x9d>
    <12a>   DW_AT_decl_file   : 2
    <12b>   DW_AT_decl_line   : 123
    <12c>   DW_AT_data_member_location: 2 byte block: 23 0 	(DW_OP_plus_uconst: 0)
 <2><12f>: Abbrev Number: 5 (DW_TAG_member)
    <130>   DW_AT_name        : (indirect string, offset: 0x246): progress_1000
    <134>   DW_AT_type        : <0x9d>
    <138>   DW_AT_decl_file   : 2
    <139>   DW_AT_decl_line   : 124
    <13a>   DW_AT_data_member_location: 2 byte block: 23 8 	(DW_OP_plus_uconst: 8)
 <2><13d>: Abbrev Number: 5 (DW_TAG_member)
    <13e>   DW_AT_name        : (indirect string, offset: 0x254): time_started
    <142>   DW_AT_type        : <0x9d>
    <146>   DW_AT_decl_file   : 2
    <147>   DW_AT_decl_line   : 125
    <148>   DW_AT_data_member_location: 2 byte block: 23 10 	(DW_OP_plus_uconst: 16)
 <2><14b>: Abbrev Number: 5 (DW_TAG_member)
    <14c>   DW_AT_name        : (indirect string, offset: 0x261): time_stopped
    <150>   DW_AT_type        : <0x9d>
    <154>   DW_AT_decl_file   : 2
    <155>   DW_AT_decl_line   : 126
    <156>   DW_AT_data_member_location: 2 byte block: 23 18 	(DW_OP_plus_uconst: 24)
 <2><159>: Abbrev Number: 5 (DW_TAG_member)
    <15a>   DW_AT_name        : (indirect string, offset: 0x26e): num_write_errors
    <15e>   DW_AT_type        : <0x9d>
    <162>   DW_AT_decl_file   : 2
    <163>   DW_AT_decl_line   : 127
    <164>   DW_AT_data_member_location: 2 byte block: 23 20 	(DW_OP_plus_uconst: 32)
 <2><167>: Abbrev Number: 5 (DW_TAG_member)
    <168>   DW_AT_name        : (indirect string, offset: 0x27f): num_uncorrectable_read_errors
    <16c>   DW_AT_type        : <0x9d>
    <170>   DW_AT_decl_file   : 2
    <171>   DW_AT_decl_line   : 128
    <172>   DW_AT_data_member_location: 2 byte block: 23 28 	(DW_OP_plus_uconst: 40)
 <2><175>: Abbrev Number: 0
 <1><176>: Abbrev Number: 9 (DW_TAG_array_type)
    <177>   DW_AT_type        : <0x9d>
 <2><17b>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <17c>   DW_AT_type        : <0x112>
    <180>   DW_AT_lower_bound : 0
    <181>   DW_AT_count       : 64
 <2><182>: Abbrev Number: 0
 <1><183>: Abbrev Number: 0

